ams/src/Documents/_ПриемТоваров/_ПриемТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>_ПриемТоваров</name>
  <posting>Deny</posting>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef._СтатусыПриемаТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оформлено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef._ПриемИзПереработки</types>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/Enums/_СтатусыПриемаТоваров/_СтатусыПриемаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>_СтатусыПриемаТоваров</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

ams/src/Documents/_ПриемИзПереработки/_ПриемИзПереработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>_ПриемИзПереработки</name>
  <registerRecords>AccumulationRegister._ТоварыПереданные</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеТоваров</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.ВариантыКомплектацииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СборкаТоваров</name>
      <type>
        <types>DocumentRef.СборкаТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/Documents/_ПриемТоваров/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем МемоСтатус;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Склад.СписокВыбора.Добавить(AMS_ВызовСервера.Цех1());
	Элементы.Склад.СписокВыбора.Добавить(AMS_ВызовСервера.Цех2());
	Элементы.Склад.СписокВыбора.Добавить(AMS_ВызовСервера.Цех3());
	Элементы.Склад.СписокВыбора.Добавить(AMS_ВызовСервера.Цех4());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МемоСтатус = Объект.Статус;
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление._СтатусыПриемаТоваров.Закрыт") Тогда
		ЗаполнитьДокумент();

		Отказ = Ложь;

		ПроверитьДокументПередЗакрытием(Отказ);

		Если Отказ Тогда
			Объект.Статус = МемоСтатус;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;

	Номенклатура = Стр.Номенклатура;

	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Стр.Остаток = ПолучитьОстаток(Номенклатура, Объект.Склад, Объект.Дата);

		Данные = ПолучитьДанные(Номенклатура, Объект.Склад, Объект.Дата);
		Если Данные = Неопределено Тогда
			Стр.Оформлено = 0;
			Стр.Упаковка  = ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка");
			Стр.Документ  = Неопределено;
			Стр.Партнер   = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
		Иначе
			Стр.Оформлено = Данные.Оформлено;
			Стр.Упаковка  = Данные.Упаковка;
			Стр.Документ  = Данные.Документ;
			Стр.Партнер   = Данные.Партнер;
		КонецЕсли;

	Иначе
		Стр.Остаток    = 0;
		Стр.Количество = 0;
		Стр.Оформлено  = 0;
		Стр.Упаковка   = ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка");
		Стр.Документ   = Неопределено;
		Стр.Партнер    = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДокументПриИзменении(Элемент)
	Стр = ТекущийЭлемент.ТекущиеДанные;

	Номенклатура = Стр.Номенклатура;
	Документ     = Стр.Документ;

	Если ЗначениеЗаполнено(Документ) Тогда
		Данные = ПолучитьОформлено(Номенклатура, Документ, Объект.Склад);

		Если Данные = Неопределено Тогда
			Стр.Оформлено = 0;
			Стр.Упаковка  = ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка");
			Стр.Партнер   = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
		Иначе
			Стр.Оформлено = Данные.Оформлено;
			Стр.Упаковка  = Данные.Упаковка;
			Стр.Партнер   = Данные.Партнер;
		КонецЕсли;

	Иначе
		Стр.Оформлено  = 0;
		Стр.Упаковка   = ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка");
		Стр.Партнер    = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьДокумент();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеДокументы(Команда)
	МенюОтчетыУТКлиент.СтруктураПодчиненности(Объект.Ссылка, Неопределено);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьДокументПередЗакрытием(Отказ)
	ЗаполнитьДокумент();

	Отказ = Ложь;
	Для Каждого Стр Из Объект.Товары Цикл
		Если Стр.Количество <> Стр.Оформлено Или Стр.Упаковка <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Стр.Номенклатура, "ЕдиницаДляОтчетов") Тогда
			ОбщегоНазначения.СообщитьПользователю("Строка " + Стр.НомерСтроки + " оформлена не правильно.", , , , Отказ);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокумент()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить( , "Номенклатура,Количество,Документ"));

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество КАК Количество
	|ПОМЕСТИТЬ тов
	|ИЗ
	|	&Товары КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество КАК Оформлено,
	|	н.ЕдиницаДляОтчетов КАК Упаковка,
	|	д.Ссылка КАК Документ,
	|	д.Партнер КАК Партнер
	|ПОМЕСТИТЬ оформ
	|ИЗ
	|	Документ._ПриемИзПереработки.Товары КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ._ПриемИзПереработки КАК д
	|		ПО т.Ссылка = д.Ссылка
	|			И (д.Склад = &Склад)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК н
	|		ПО т.Номенклатура = н.Ссылка
	|ГДЕ
	|	д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И д.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Номенклатура,
	|	т.КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА т.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА н.ЕдиницаДляОтчетов
	|		ИНАЧЕ т.Упаковка
	|	КОНЕЦ,
	|	д.Ссылка,
	|	д.Партнер
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК д
	|		ПО т.Ссылка = д.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК н
	|		ПО т.Номенклатура = н.Ссылка
	|			И (т.Склад = &Склад)
	|ГДЕ
	|	д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И д.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА тов.Номенклатура ЕСТЬ NULL
	|			ТОГДА оформ.Номенклатура
	|		ИНАЧЕ тов.Номенклатура
	|	КОНЕЦ КАК Номенклатура,
	|	ЕСТЬNULL(тов.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(оформ.Оформлено, 0) КАК Оформлено,
	|	оформ.Упаковка КАК Упаковка,
	|	оформ.Документ КАК Документ,
	|	оформ.Документ.Партнер КАК Партнер
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	тов КАК тов
	|		ПОЛНОЕ СОЕДИНЕНИЕ оформ КАК оформ
	|		ПО тов.Номенклатура = оформ.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА Ост.ВНаличииОстаток ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ Ост.ВНаличииОстаток / н.КоэффициентЕдиницыДляОтчетов
	|	КОНЕЦ КАК Остаток
	|ПОМЕСТИТЬ ост
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ), Склад = &Склад) КАК Ост
	|		ПО вт.Номенклатура = Ост.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК н
	|		ПО вт.Номенклатура = н.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	ост.Остаток КАК Остаток,
	|	вт.Количество КАК Количество,
	|	вт.Оформлено КАК Оформлено,
	|	вт.Упаковка КАК Упаковка,
	|	вт.Документ КАК Документ,
	|	вт.Партнер КАК Партнер
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ост КАК ост
	|		ПО вт.Номенклатура = ост.Номенклатура";

	Объект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОстаток(Номенклатура, Склад, Дата)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Дата", Дата);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ост.Номенклатура,
	|	Ост.ВНаличииОстаток / Ост.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК Остаток
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ),
	|			Склад = &Склад
	|				И Номенклатура = &Номенклатура) КАК Ост";

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 0;
	Иначе
		Возврат Результат.Выгрузить()[0].Остаток;
	КонецЕсли;
КонецФункции
&НаСервереБезКонтекста
Функция ПолучитьДанные(Номенклатура, Склад, Дата)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Дата", Дата);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество КАК Оформлено,
	|	н.ЕдиницаДляОтчетов КАК Упаковка,
	|	д.Ссылка КАК Документ,
	|	д.Партнер КАК Партнер
	|ИЗ
	|	Документ._ПриемИзПереработки.Товары КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ._ПриемИзПереработки КАК д
	|		ПО т.Ссылка = д.Ссылка
	|			И (д.Склад = &Склад)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК н
	|		ПО т.Номенклатура = н.Ссылка
	|ГДЕ
	|	д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И д.Проведен
	|	И т.Номенклатура = &Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Номенклатура,
	|	т.КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА т.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА н.ЕдиницаДляОтчетов
	|		ИНАЧЕ т.Упаковка
	|	КОНЕЦ,
	|	д.Ссылка,
	|	д.Партнер
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК д
	|		ПО т.Ссылка = д.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК н
	|		ПО т.Номенклатура = н.Ссылка
	|			И (т.Склад = &Склад)
	|ГДЕ
	|	д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И д.Проведен
	|	И т.Номенклатура = &Номенклатура";

	Табл = Запрос.Выполнить().Выгрузить();

	Если Табл.Количество() = 0 Тогда
		Возврат Неопределено;

	Иначе
		Стр = Табл[0];

		Данные = Новый Структура("Оформлено,Упаковка,Документ", Стр.Оформлено, Стр.Упаковка, Стр.Документ);
		Данные.Вставить("Партнер", Стр.Партнер);

		Возврат Данные;
	КонецЕсли;
КонецФункции
&НаСервереБезКонтекста
Функция ПолучитьОформлено(Номенклатура, Документ, Склад)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Склад", Склад);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество КАК Оформлено,
	|	н.ЕдиницаДляОтчетов КАК Упаковка,
	|	д.Партнер КАК Партнер
	|ИЗ
	|	Документ._ПриемИзПереработки.Товары КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ._ПриемИзПереработки КАК д
	|		ПО т.Ссылка = д.Ссылка
	|			И (д.Склад = &Склад)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК н
	|		ПО т.Номенклатура = н.Ссылка
	|ГДЕ
	|	т.Ссылка = &Документ
	|	И т.Номенклатура = &Номенклатура
	|	И д.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Номенклатура,
	|	т.КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА т.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА н.ЕдиницаДляОтчетов
	|		ИНАЧЕ т.Упаковка
	|	КОНЕЦ,
	|	д.Партнер
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК д
	|		ПО т.Ссылка = д.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК н
	|		ПО т.Номенклатура = н.Ссылка
	|			И (т.Склад = &Склад)
	|ГДЕ
	|	т.Ссылка = &Документ
	|	И т.Номенклатура = &Номенклатура
	|	И д.Проведен";

	Табл = Запрос.Выполнить().Выгрузить();

	Если Табл.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Стр = Табл[0];

		Струк = Новый Структура("Оформлено,Упаковка,Партнер");

		Струк.Оформлено = Стр.Оформлено;
		Струк.Упаковка  = Стр.Упаковка;
		Струк.Партнер   = Стр.Партнер;

		Возврат Струк;
	КонецЕсли;
КонецФункции

#КонецОбласти
